<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=windows-1251">
		<meta name="Description" content="K&R, 1st ed., 1978. Russian translation by <unknown>; chm-compiling by Sim&C, Belarus`2006">
   		<title>1.5.4 Подсчет строк</title>
		<link href="../style.css" rel="stylesheet" type="text/css" media="all">
	</head>

	<body>
	<script  language=JavaScript  src="../header.js"></script>
		<p>Следующая программа подсчитывает количество строк в файле ввода. Предполагается, что строки ввода заканчиваются символом новой строки \n, скрупулезно добавленным к каждой выписанной строке.</p>
		<blockquote>
			<pre class="cpp">main()  /* count lines in input */
{
  int c,nl;
  nl = 0;
  while ((c = getchar()) != EOF)
  if (c =='\n')
    ++nl;
  printf("%d\n", nl);
}</pre>
		</blockquote>
		<p>Тело while теперь содержит оператор if, который в свою очередь управляет оператором увеличения ++nl. Оператор if проверяет заключенное в круглые скобки условие и, если оно истинно, выполняет следующий за ним оператор (или группу операторов, заключенных в фигурные скобки). Мы опять использовали сдвиг вправо, чтобы показать, что чем управляет.</p>
		<p>Удвоенный знак равенства == является обозначением в языке C для "равно" (аналогично .EQ. в Фортране). Этот символ введен для того, чтобы отличать проверку на равенство от одиночного =, используемого при присваивании. Поскольку в типичных C - программах знак присваивания встречается примерно в два раза чаще, чем проверка на равенство, то естественно, чтобы знак оператора был вполовину короче.</p>
<p>Любой отдельный символ может быть записан внутри одиночных кавычек, и при этом ему соответствует значение, равное численному значению этого символа в машинном наборе символов; это называется символьной константой. Так, например, 'A' - символьная константа; ее значение в наборе символов ASCII (американский стандартный код для обмена информацией) равно 65, внутреннему представлению символа а. Конечно, 'A' предпочтительнее, чем 65: его смысл очевиден и он не зависит от конкретного машинного набора символов.</p>
		<p>Условные последовательности, используемые в символьных строках, также занимают законное место среди символьных констант. Так в проверках и арифметических выражениях '\n' представляет значение символа новой строки. Вы должны твердо уяснить, что '\n' - отдельный символ, который в выражениях эквивалентен одиночному целому; с другой стороны &quot;\n&quot; - это символьная строка, которая содержит только один символ. Вопрос о сопоставлении строк и символов обсуждается в <a href="../chapter2/2.html">главе&nbsp;2</a>.</p>
		<div class="exercise">
			<p><span class="exercisetitle">Упражнение 1-6</span></p>
			<p>Напишите программу для подсчета пробелов, табуляций и новых строк.</p>
			<p><span class="exercisetitle">Упражнение 1-7</span></p>
			<p>Напишите программу, которая копирует ввод на вывод, заменяя при этом каждую последовательность из одного или более пробелов на один пробел.</p>
		</div>
		<script  language=JavaScript  src="../footer.js"></script>
	</body>
	
</html>